DELETE
FROM user_roles;
DELETE
FROM restaurants;
DELETE
FROM votes;
DELETE
FROM meals;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),/*100000*/
       ('Admin', 'admin@gmail.com', 'admin');/*100001*/

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001),
       ('USER', 100001);

INSERT INTO restaurants(name)
VALUES ('Plove'),
       ('Seven'),
       ('Свитер');

INSERT INTO meals (name, price, date, restaurant_id)
VALUES ('Форель в фольге', 900, '2020-05-10', 100004),
       ('Суп-пюре из шампиньонов', 150, '2020-05-10', 100004),
       ('Греческий салат', 350, '2020-05-10', 100004),
       ('Фруктовый салат', 250, '2020-05-09', 100004),
       ('Плов', 900, '2020-05-09', 100004),
       ('Суп-пюре из шампиньонов', 150, '2020-01-31', 100004),
       ('Весенний салат', 350, '2020-01-31', 100004),
       ('Брауни', 200, CURDATE(), 100002),
       ('Наполеон', 250, CURDATE(), 100002),
       ('Пирожное Павлова', 350, CURDATE(), 100002),
       ('Морковный торт', 200, '2020-01-31', 100002),
       ('Круассан', 150, '2020-01-31', 100002),
       ('Творожное пирожное', 150, '2020-01-31', 100002),
       ('Суп из морепродуктов', 700, '2020-05-10', 100003),
       ('Салат Оливье', 350, '2020-05-10', 100003),
       ('Карамельный торт', 350, '2020-05-10', 100003),
       ('Морковный торт', 400, '2020-01-31', 100003),
       ('Борщ', 350, '2020-01-31', 100003),
       ('Салат с осминогом', 1500, '2020-01-31', 100003);

INSERT INTO votes(placed, restaurant_id, user_id)
VALUES (CURDATE() + ' 08:00:00', 100002, 100000),
       (CURDATE() + ' 13:00:00', 100003, 100001),
       ('2020-01-31 08:00:00', 100004, 100000),
       ('2020-01-31 13:00:00', 100002, 100001);
