DELETE
FROM user_roles;
DELETE
FROM restaurants;
DELETE
FROM votes;
DELETE
FROM meals;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),/*100000*/
       ('Admin', 'admin@gmail.com', 'admin');/*100001*/

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),/* 100002*/
       ('ADMIN', 100001),/* 100003*/
       ('USER', 100001);/* 100004*/

INSERT INTO restaurants(name)
VALUES ('Plove'), /* 100005*/
       ('Семейные ценности'),/* 100006*/
       ('Приют холостяка');
/* 100007*/

/*INSERT INTO menus(enabled, restaurant_id)
VALUES ('2020-01-30', 100005),
       ('2020-01-30', 100006),
       ('2020-01-30', 100007);*/

INSERT INTO meals (name, price, enabled, restaurant_id)
VALUES /*('Форель в фольге', 900, '2020-01-30', 100002),
       ('Суп-пюре из шампиньонов', 150, '2020-01-30', 100002),
       ('Греческий салат', 350, '2020-01-30', 100002),
       ('Фруктовый салат', 250, '2020-01-30', 100002),
       ('Плов', 900, '2020-01-31', 100002),
       ('Суп-пюре из шампиньонов', 150, '2020-01-31', 100002),
       ('Весенний салат', 350, '2020-01-31', 100002),*/
    ('Брауни', 200, '2020-01-30', 100002),
    ('Наполеон', 250, '2020-01-30', 100002),
    ('Пирожное Павлова', 350, '2020-01-30', 100002),
    ('Морковный торт', 200, '2020-01-31', 100002),
    ('Круассан', 150, '2020-01-31', 100002),
    ('Творожное пирожное', 150, '2020-01-31', 100002),
    ('Суп из морепродуктов', 700, '2020-01-30', 100003),
    ('Салат Оливье', 350, '2020-01-30', 100003),
    ('Карамельный торт', 350, '2020-01-30', 100003),
    ('Морковный торт', 400, '2020-01-31', 100003),
    ('Борщ', 350, '2020-01-31', 100003),
    ('Салат с осминогом', 1500, '2020-01-31', 100003);

INSERT INTO votes(placed, restaurant_id, user_id)
VALUES ('2020-01-30 08:00:00', 100002, 100000),
       ('2020-01-30 13:00:00', 100003, 100001),
       ('2020-01-31 08:00:00', 100004, 100000),
       ('2020-01-31 13:00:00', 100002, 100001);
